% Q2_EI_E2_E3.m
% تعریف ماتریس های A و B
A = [6 9 5; 
     8 7 2; 
     1 3 4; 
     5 2 8];
B = [4 8; 
     3 7; 
     2 3; 
     5 1];

% الف) ساخت ماتریس EI از دو ستون میانی A
EI = A(:, 2:3);

% ب) ساخت ماتریس E2 از سطرهای 1 و 2 و ستون های 2 و 3 ماتریس A
E2 = A([1 2], [2 3]);

% ج) ساخت ماتریس E3 با ترکیب B و EI
E3 = [B EI];

% نمایش نتایج
disp('ماتریس EI:');
disp(EI);
disp('ماتریس E2:');
disp(E2);
disp('ماتریس E3:');
disp(E3);

% ذخیره نتایج
save('../Data/Results/Q3_results.mat', 'EI', 'E2', 'E3');


element_product = A(4,2) * B(2,1); 
disp('حاصل ضرب A(4,2) و B(2,1):');
disp(element_product);